In [1]:
!pip3 install pandas

Requirement already satisfied: pandas in /home/aabir/anaconda3/lib/python3.8/site-packages (1.2.3)
Requirement already satisfied: python-dateutil>=2.7.3 in /home/aabir/anaconda3/lib/python3.8/site-packages (from pandas) (2.8.1)
Requirement already satisfied: pytz>=2017.3 in /home/aabir/anaconda3/lib/python3.8/site-packages (from pandas) (2021.1)
Requirement already satisfied: numpy>=1.16.5 in /home/aabir/anaconda3/lib/python3.8/site-packages (from pandas) (1.19.2)
Requirement already satisfied: six>=1.5 in /home/aabir/anaconda3/lib/python3.8/site-packages (from python-dateutil>=2.7.3->pandas) (1.15.0)

In [4]:
import numpy as np
pokemons = {
    'Pikachu': np.random.randint(1,100,5),
    'Bulbasaur': np.random.randint(50,150,5),
}

In [5]:
pokemons

{'Pikachu': array([58, 31, 74, 62, 82]),
 'Bulbasaur': array([127, 147, 114,  72,  97])}

In [7]:
details = {
    'Height': np.random.randint(1,100,5),
    'Weight': np.random.randint(50,150,5),
    'Age': np.random.randint(14,40,5)
}

In [8]:
details

{'Height': array([52, 25, 77, 45, 80]),
 'Weight': array([ 64,  73, 128,  54,  93]),
 'Age': array([31, 29, 15, 27, 31])}

In [9]:
import pandas as pd

In [10]:
df = pd.DataFrame(details)
print(df)

   Height  Weight  Age
0      52      64   31
1      25      73   29
2      77     128   15
3      45      54   27
4      80      93   31

In [11]:
df.head()

   Height  Weight  Age
0      52      64   31
1      25      73   29
2      77     128   15
3      45      54   27
4      80      93   31

In [12]:
df.head(n=3)

   Height  Weight  Age
0      52      64   31
1      25      73   29
2      77     128   15

In [14]:
df.columns

Index(['Height', 'Weight', 'Age'], dtype='object')

In [15]:
#create a csv (comma separate) file
df.to_csv('details.csv')

In [16]:
#Read a DataFrame

In [ ]:
- Kaggle Challenges --> CSV Files

In [18]:
df = pd.read_csv('details.csv')

In [19]:
df.head()

   Unnamed: 0  Height  Weight  Age
0           0      52      64   31
1           1      25      73   29
2           2      77     128   15
3           3      45      54   27
4           4      80      93   31

In [20]:
df.shape

(5, 4)

In [21]:
df.drop(columns=['Unnamed: 0'])

   Height  Weight  Age
0      52      64   31
1      25      73   29
2      77     128   15
3      45      54   27
4      80      93   31